{
    "Data": {
        "HtmlData":"<h1 style="font: 40px;">barcode reader (POS scanner, bar code reader, price scanner) </h1>

        <section class="section definition-section" data-menu-title="Definition" id="content-body" style="margin-top: -292px;">
            <p>A barcode reader, also called a price scanner or point-of-sale ( <a href="http://whatis.techtarget.com/definition/point-of-sale-terminal-POS-terminal">POS</a> ) scanner, is a hand-held or stationary input device used to capture and read information contained in a <a href="http://searchmanufacturingerp.techtarget.com/definition/bar-code">bar code</a> . A barcode reader consists of a <a href="http://whatis.techtarget.com/definition/scanner">scanner</a> , a decoder (either built-in or external), and a <a href="http://searchdatacenter.techtarget.com/definition/coaxial-cable">cable</a> used to connect the reader with a computer. Because a barcode reader merely captures and translates the barcode into numbers and/or letters, the data must be sent to a computer so that a software application can make sense of the data. Barcode scanners can be connected to a computer through a <a href="http://searchdatacenter.techtarget.com/definition/coaxial-cable">serial port</a> , keyboard <a href="http://searchnetworking.techtarget.com/definition/port">port</a> , or an interface device called a <a href="http://whatis.techtarget.com/definition/keyboard-wedge-KBW">wedge</a> . A barcode reader works by directing a beam of light across the <a href="http://searchmanufacturingerp.techtarget.com/definition/bar-code">bar code</a> and measuring the amount of light that is reflected back. (The dark bars on a barcode reflect less light than the white spaces between them.) The scanner converts the light energy into electrical energy, which is then converted into data by the decoder and forwarded to a computer.</p>
            
            <p>There are five basic kinds of barcode readers -- pen wands, slot scanners, Charge-Couple Device ( <a href="http://searchstorage.techtarget.com/definition/charge-coupled-device">CCD</a> ) scanners, image scanners, and laser scanners.</p> 
            <ul style="margin:0 0 20px 25px;"> 
                <li>A pen wand is the simplest barcode reader. It contains no moving parts and is known for its durability and low cost. A pen wand can present a challenge to the user, however, because it has to remain in direct contact with the bar code, must be held at a certain angle, and has to be moved over the bar code at a certain speed.</li> 
            </ul> 
            <ul style="margin:0 0 20px 25px;"> 
                <li>A slot scanner remains stationary and the item with the bar code on it is pulled by hand through the slot. Slot scanners are typically used to scan bar codes on identification cards.</li> 
            </ul> 
            <ul style="margin:0 0 20px 25px;"> 
                <li>A CCD scanner has a better read-range than the pen wand and is often used in retail sales. Typically, a CCD scanner has a "gun" type interface and has to be held no more than one inch from the bar code. Each time the bar code is scanned, several readings are taken to reduce the possibility of errors. A disadvantage of the CCD scanner is that it cannot read a bar code that is wider than its input face.</li> 
            </ul> 
            <ul style="margin:0 0 20px 25px;"> 
                <li>An image scanner, also called a camera reader, uses a small video camera to capture an image of the bar code and then uses sophisticated digital image processing techniques to decode the bar code. It can read a bar code from about 3 to 9 inches away and generally costs less than a laser scanner.</li> 
            </ul> 
            <ul style="margin:0 0 20px 25px;"> 
                <li>A laser scanner, either hand-held or stationary, does not have to be close to the bar code in order to do its job. It uses a system of mirrors and lenses to allow the scanner to read the bar code regardless of orientation, and can easily read a bar code up to 24 inches away. To reduce the possibility of errors, a laser scanning may perform up to 500 scans per second. Specialized long-range laser scanners are capable of reading a bar code up to 30 feet away.</li> 
            </ul>
        </section>'
    }
}